Import Libraries

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

Exploring Data

In [28]:
df = pd.read_csv("D:/Technohacks/Titanic Disaster/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df.shape

(891, 12)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [70]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,871.000000,871.000000,871.000000,871.000000,871.000000,871.000000,871.000000
mean,445.319173,0.376579,2.338691,29.668789,0.517796,0.366246,26.530170
std,257.761917,0.484806,0.821469,13.024141,1.101448,0.792325,29.351184
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,221.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.895800
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,13.862500
75%,665.500000,1.000000,3.000000,35.000000,1.000000,0.000000,30.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,164.866700

Data Cleaning

In [32]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [33]:
df["Age"].fillna((df["Age"].mean()),inplace = True)

In [34]:
df.Age.isnull().sum()

0

In [35]:
df.Cabin.dropna(how='all',inplace=True)

In [36]:
df.Cabin.isnull().sum()

687

In [37]:
df.drop(['Cabin'],axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,Q

In [38]:
df.duplicated().sum()

0

In [39]:
df.Fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

Remove outlier value from Fare column

In [40]:
df.drop(df.loc[df['Fare']>=170].index , inplace = True)

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,871.000000,871.000000,871.000000,871.000000,871.000000,871.000000,871.000000
mean,445.319173,0.376579,2.338691,29.668789,0.517796,0.366246,26.530170
std,257.761917,0.484806,0.821469,13.024141,1.101448,0.792325,29.351184
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,221.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.895800
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,13.862500
75%,665.500000,1.000000,3.000000,35.000000,1.000000,0.000000,30.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,164.866700

In [41]:
NotSur = df["Age"][df.Survived==0]
NotSur.value_counts()

Age
29.699118    123
21.000000     19
28.000000     18
25.000000     17
18.000000     17
            ...
32.500000      1
23.500000      1
36.500000      1
55.500000      1
74.000000      1
Name: count, Length: 78, dtype: int64

In [42]:
sur = df["Age"][df.Survived==1]
sur.value_counts()

Age
29.699118    52
24.000000    14
22.000000    11
27.000000    11
30.000000    10
             ..
55.000000     1
0.920000      1
37.000000     1
32.500000     1
47.000000     1
Name: count, Length: 65, dtype: int64

Calculate summary statistics to age of survived people

In [43]:
print("Mean of age to survived people : ",int(sur.mean()))
print("Median of age to survived people : ",int(sur.median()))
print("Mode of age to survived people : ",int(sur.mode()))
print("Standard deviation) of age to survived people : ",int(sur.std()))

Mean of age to survived people :  28
Median of age to survived people :  29
Mode of age to survived people :  29
Standard deviation) of age to survived people :  13

Calculate summary statistics to age of Not suvived people

In [44]:
print("Mean of age to not survived people : ",int(NotSur.mean()))
print("Median of age to not survived people : ",int(NotSur.median()))
print("Mode of age to not survived people : ",int(NotSur.mode()))
print("Standard deviation) of age to not survived people : ",int(NotSur.std()))

Mean of age to not survived people :  30
Median of age to not survived people :  29
Mode of age to not survived people :  29
Standard deviation) of age to not survived people :  12

Calculate summary statistics to Fare

In [69]:
print("Mean of Fare : ",int(df.Fare.mean()))
print("Median of Fare : ",int(df.Fare.median()))
print("Mode of Fare : ",int(df.Fare.mode()))
print("Standars deviation of Fare : ",int(df.Fare.std()))

Mean of Fare :  26
Median of Fare :  13
Mode of Fare :  8
Standars deviation of Fare :  29

In [55]:
FemaleAge = df["Age"][df.Sex=='female']
FemaleAge.value_counts()

Age
29.699118    53
24.000000    15
22.000000    12
30.000000    11
18.000000    11
             ..
10.000000     1
55.000000     1
60.000000     1
14.500000     1
56.000000     1
Name: count, Length: 64, dtype: int64

In [52]:
MaleAge = df["Age"][df.Sex=='male']
MaleAge.value_counts()

Age
29.699118    122
28.000000     18
25.000000     18
19.000000     17
21.000000     17
            ...
55.500000      1
66.000000      1
15.000000      1
0.920000       1
74.000000      1
Name: count, Length: 83, dtype: int64

calculate summary statistics to Male age

In [65]:
print("Mean of Male age : ",MaleAge.mean())
print("Median of Male age : ",MaleAge.median())
print("Mode of Male age : ",MaleAge.mode())
print("Standard deviation of Male age : ",MaleAge.std())

Mean of Male age :  30.47005685929908
Median of Male age :  29.69911764705882
Mode of Male age :  0    29.699118
Name: Age, dtype: float64
Standard deviation of Male age :  13.008984007649934

calculate summary statistics to Female age

In [66]:
print("Mean of Female age : ",FemaleAge.mean())
print("Median of Female age : ",FemaleAge.median())
print("Mode of Female age : ",FemaleAge.mode())
print("Standard deviation of Female age : ",FemaleAge.std())

Mean of Female age :  28.15911667315933
Median of Female age :  29.69911764705882
Mode of Female age :  0    29.699118
Name: Age, dtype: float64
Standard deviation of Female age :  12.939706843296719